In [6]:
import pandas as pd
import numpy as np
dates = pd.to_datetime("27th of march, 2023")
i = dates + pd.to_timedelta(np.arange(5),unit = 'D')
d = [50,36,8,99,5]
time_series = pd.Series(data =d , index = i)
print(time_series)

2023-03-27    50
2023-03-28    36
2023-03-29     8
2023-03-30    99
2023-03-31     5
dtype: int64

In [7]:
import numpy as np
import pandas as pd
name = ["name" , "add","university","city"]
student = ["sanket","surat","gtu","surat,gujarat"]
data = pd.Series(student , index = name)
print(data)

name                 sanket
add                   surat
university              gtu
city          surat,gujarat
dtype: object

In [9]:
import pandas as pd
import numpy as np
arr = np.random.randint(0,100,10).reshape(5,2)
df = pd.DataFrame(arr,np.arange(101,106),['ada','pds'])
print(df)

     ada  pds
101   30   82
102   58   44
103   34   98
104   41   80
105   99   40

In [11]:
df['total'] = df['ada'] + df['pds']
print(df)

     ada  pds  total
101   30   82    112
102   58   44    102
103   34   98    132
104   41   80    121
105   99   40    139

In [17]:
df.loc[[101,104]]

     ada  pds  total
101   30   82    112
104   41   80    121

In [19]:
df.drop('total',axis=1,inplace=True)
print(df)

     ada  pds
101   30   82
102   58   44
103   34   98
104   41   80
105   99   40

In [20]:
dfbool = df>50
print(dfbool)

       ada    pds
101  False   True
102   True  False
103  False   True
104  False   True
105   True  False

In [21]:
dfbool1 = df['pds']>50
print(dfbool1)

101     True
102    False
103     True
104     True
105    False
Name: pds, dtype: bool

In [22]:
print(df)

     ada  pds
101   30   82
102   58   44
103   34   98
104   41   80
105   99   40

In [23]:
df.index.name = "rollno."
print(df)

         ada  pds
rollno.
101       30   82
102       58   44
103       34   98
104       41   80
105       99   40

In [26]:
df.set_index('pds')

     ada
pds
82    30
44    58
98    34
80    41
40    99

In [27]:
df.reset_index()

   rollno.  ada  pds
0      101   30   82
1      102   58   44
2      103   34   98
3      104   41   80
4      105   99   40

In [30]:
import pandas as pd
data = {"col":["sanket","sanket","uttam","uttam"],
        "dep":['ce','ce','it','it'],
        "sem":[5,5,7,7],
        "rn":[101,102,103,104],
        "s1":[95,56,25,58]
       }
df =pd.DataFrame(data)

In [31]:
df

      col dep  sem   rn  s1
0  sanket  ce    5  101  95
1  sanket  ce    5  102  56
2   uttam  it    7  103  25
3   uttam  it    7  104  58

In [53]:
import pandas as pd
fcsv = pd.read_csv("details.csv",index_col=[0,1,2,3])
fcsv

                  s1  s2  s3
  col    dep sem
0 abc    ce  5     9  23  35
1 abc    ce  5     6   5   5
2 sanket it  7     2  56  65
3 sanket it  7     2   2   6